Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionValueUnits Enumeration
 The units usable with the dimensions.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DimensionValueUnits
Public Enumeration DimensionValueUnits
Members
Member name | Value | Description
Automatic | 0 |  The unit of the value is selected automatically.
Millimeter | 1 |  The value is shown in millimeters.
Centimeter | 2 |  The value is shown in centimeters.
Meter | 3 |  The value is shown in meters.
Inch | 4 |  The value is shown in inches.
See Also
Reference
Tekla.Structures.Drawing Namespace